<?php



$textStart   = "🙋🏻‍♂️ - مرحبا بك يا ++TGNAME++
🤖 - بوت ⌯  *$BotNM* لعمل الأرقام الوهمية. 📞

🌐 - البوت *الأقوى* في التليجرام لعمل أرقام *وهمية* من 180+ دولة عربية وأجنبية حول العالم.

🔝 - *أنشئ* حسابك *الآن* وقم بشراء رقمك 📲

🧑🏻‍💻 *- إدارة البوت:* [$manger] 🌟.";
"🪗 - يرجى بدء الاستخدام *بإنشاء حساب* ، اذا لديك حساب من قبل ، قم بالضغط على زر *تسجيل الدخول* ✅.";

$reved      = "☑️ - تم الحصول على ₽++INV++ روبل من رابط الدعوة . 👤 - من خلال دعوتك لحساب  ++NM++";
$pleaseJoin      = "🖐 *- مرحبا* ++TGNAME++ .♥️

*- يرجى الإشتراك في قناة البوت أولاً ، حتى تتمكن من إستخدام البوت ⚠️.*

- قناة البوت : [++CHANNEL++] 📡.

*- بعد الإشتراك ، إضغط على زر بالأسفل.*";

$continueTo      = "- لقد انضميت الى القناة ✅.";
//// all text in starting

$posts_text = [
	'start'=>"{$textStart}",
	'2nd_start'=>"🪗 - يرجى بدء الاستخدام *بإنشاء حساب* ، اذا لديك حساب من قبل ، قم بالضغط على زر *تسجيل الدخول* ✅.",
	'select_app'=>"☑️ - هذه قائمة البرامج المتوفرة لـ تفعيل الأرقام.\n📲 - إختر البرنامج الذي تريد تفعيل رقم فيه.",
	'reace_rand'=>"☑️ ¦ هذه قائمة البرامج المتوفرة لـ تفعيل الأرقام.\n☑️ ¦ إختر البرنامج الذي تريد تفعيل رقم فيه.",
	'reace_show'=>"☑️ ¦ هذه قائمة البرامج المتوفرة لـ تفعيل الأرقام.\n☑️ ¦ إختر البرنامج الذي تريد تفعيل رقم فيه.",
	'reace_pro'=>"☑️ ¦ هذه قائمة البرامج المتوفرة لـ تفعيل الأرقام.\n☑️ ¦ إختر البرنامج الذي تريد تفعيل رقم فيه.",
	'menu_start'=>"👨‍✈️ ⁞ أهلا بك في القائمة الرئيسية. 🏡\n👨‍✈️ ⁞ هذه تفاصيل حسابك في بوت ⌯ $BotNM . ⬇️\n\n📧 ⁞ إيميلك: ++EMAIL++ 🌚🌙.\n💰 ⁞ رصيدك: ₽ ++BALANCE++🌻🙂.\n💸 ⁞ عدد الروبل المصروف : ++SALE++ 💰\n🆔 ⁞ الأيدي: ++ID++\n☑️ ⁞ قناة البوت الرسمية: $channelbotig\n🎬 ⁞ قم بالتحكم بالبوت الأن عبر الضغط على الأزرار بالأسفل ⬇️.",
	'select_country'=>"☑️ ⁞ التطبيق: ++APPNAME++ .\n\n🏋‍♂ ⁞ يرجى إختيار الدولة التي تريد شراء رقم لها من الأسفل, أيضا يمكنك البحث عليها بسرعة بالضغط على زر البحث 🔎",
	'select_server'=>"- تم إختيار الدولة ( *++COUNTRY++* ) بنجاح ✅.\n\n- يرجى إختيار السيرفر المراد الشراء منه*, كل سيرفر يمتلك سعر خاص فيه, وكل سيرفر له توريده الخاص*.\n\n☑️ ⁞ التطبيق: *++APPNAME++*",
	'invite_users'=>"🙋🏻‍♂️ - يمكنك من خلال هذه الميزة ربح روبل عن طريق مشاركة رابط الدعوة مع الآخرين!\n\n✅ ⁞ يمكنك مشاركة رابطك وتجميع الروبل وشراء الارقام بكل سهولة 🤑.\n\n☑ - رابط الدعوة الخاص بك ⬇️: [https://t.me/++UBOT++?start=++HASHMAIL++]\n💰 - أي شخص يقوم بالدخول عبر رابط الدعوة الخاص بك تحصل على ++INVITE++ روبل ✅.",
	'my_recent'=>"📊 ⁞ إحصائيات حسابك :\n\n☎️ ⁞ عدد الأرقام المكتملة: *++FULL++*\n💳 ⁞ عدد الكروت التي تم شراؤها: *++CARDSBOUGHT++*\n📞 ⁞ عدد الأرقام الجاهزة التي تم شراؤها: *++READYBOUGHT++*\n💸 ⁞ عدد الروبل المصروف: ₽ *++SALE++*\n💰 ⁞ عدد الروبل المتبقي: ₽ *++BALANCE++*\n🌟 ⁞ عدد مرات الشحن: *++TRY++* مرة.",
	'add_balance'=>"HASHKEYWALLET++\n☑️ ⁞ قسم شحن رصيد الروبل الخاص بك:\n\n✳️ ⁞ يمكنك شحن رصيدك من الإدارة مباشرة او عبر التواصل مع الوكلاء.\n✳️ ⁞ نقبل جميع طرق الدفع المذكورة بالأسفل: ⬇️\n\n👨‍✈️ ⁞ إذا كنت لا تملك طريقة دفع من الأسفل، تواصل مع الإدارة الخاصة بالبوت: $manger",
	'favourites'=>"🙋🏻‍♂️ ⁞ أهلا بك عزيزي العميل في قسم وكلاء البوت الرسميين في بوت ⌯ $BotNM ✅",
	'all_shows'=>"🌟 - *اليك قائمة العروض المتوفرة في البوت*:\n*⛔ - لاتقم بالضغط على الدولة اكثر من مرة واحده لمنع مصارفة نقاطك*",
	'cards_store'=>"✅ - قسم كروت الشحن الخاص بالبوت:\n🎲 - هنا قائمة فئات كروت الشحن الموجودة. ⬇️",
	'add_follow'=>"🔐 - قسم الرشق مغلق حالياً لغرض التجهيز ✔️.",  
	'setting'=>"⚙️ - *اليك قسم الإعدادات الخاصة بحسابك.*",
	'ready_numbers'=>"📞 - *الأرقام الجاهزة في البوت:*",
	'help'=>"*📮 ⁞ مرحبا بك في قائمة المساعدة.*",
	'search'=>"*✅ ⁞ يمكنك البحث عن الدول من هنا .\n\n🔍 ⁞ للبحث ارسل اسم او جزء من إسم الدولة أو قم بإرسال علم الدولة التي تريد البحث عنها\n\n⬅️ ⁞ مثال: اليمن - او : 🇾🇪 أو : اليم\n\n⚠️ ملاحظات:\n🎗 - للحصول على نتائج أدق قم بإرسال أكثر من 3 أحرف\n⚡️ - عند إرسالك لأقل من 4 أحرف سيتم إظهار أول دولة تم العثور عليها فقط.\n🇾🇪 :- عند البحث بعلم الدولة لا تقم بكتابة شيء سوى علم الدولة مرة واحدة فقط.*",
	'found'=>"✅ - تم العثور على ++COUNT++ نتائج ⬇️",
	'notfound'=>"⛔ - *لم يتم العثور على اي نتائج* 😪.",
	'errorsearch'=>"⛔ - خطأ في بيانات البحث 🔍",
	'change_password'=>"✅ - حسنا عزيزي*، أرسل كلمة السر الجديدة:*\n⚠️ - يجب ان يكون طول كلمة السر *من 6 إلى 15 حرفٍ أو رقم*\n✔️ - يمكنك فقط استخدام *الأرقام من 0 إلى 9* *والأحرف الإنجليزية* بحالتيهما *الصغيرة* *والكبيرة*",
	'change_password2'=>"♻️ - تم تغيير كلمة مرور حسابك إلى : `++PW++` 🔑\n✅ - *نصيحة منا قم بحذف هذه الرسالة في حال كانت كلمة المرور شيء يمكنك تذكرة دائماً* ✔️",
	'buyCard'=>"🎗*- تم شراء كرت بقيمة : ++P++ روبل* ✅\n💵 *- رصيد الكرت : ++B++ روبل 💲*\n💳 *- رقم الكرت : * `++C++`",
	'confirmBuyCard'=>"💳 ⁞ *مبلغ بطاقة الشحن : ₽ ++B++\n💸 ⁞ القيمة الكلية : ₽ ++P++ ✅\n\n☑️ ⁞ هل تريد شراء الكرت بـ ₽ ++P++  ؟!*",
	'doneBuoghtCard'=>"⚜️ ⁞ *تم صنع الكرت بنجاح.* ✅\n\n💸 ⁞ السعر: ₽ ++B++\n\n💳 `++C++`\n\n✅ ⁞ *اضغط على الكرت* ليتم نسخه ✔️",
	'input_card'=>"💳 ⁞ الرجاء إرسال رمز الكرت المراد شحنه في البوت.\n✅ ⁞ ملاحظة: كروت البوت خاصة ولا يقصد بها كروت شحن لشركات او شبكات إتصالات.",
	'confirmChargeCard'=>"🌐 ⁞* الكرت: ++C++*\n💰 ⁞* القيمة: ₽ ++P++*\n🔰 ⁞ *رصيدك: ₽ ++BALANCE++*\n\n✳️ ⁞ هل تود شحن هذا الكرت في حسابك ⁉️",
	'doneChargedCard'=>"✅ ⁞ تم شحن الكرت بنجاح ☑️.\n💸 ⁞ تم إضافة ₽ ++P++ لحسابك 🔝\n🤑 ⁞ اصبح رصيدك الأن: ++BALANCE++ ₽ 💰",
	'doneChargedCard2'=>"🙋🏻‍♂️ ⁞ مرحبا بك عزيزي \n📢 ⁞ لقد قام: ++CHARGERNAME++\n\n✅ ⁞ بـ شحن كرت قمت أنت بإنتاجها ✔️.\n💳 ⁞ الكرت: *++C++*\n💸 ⁞ قيمة الكرت:* ₽ ++P++*",
	'logout'=>"🔚 *- تم تسجيل الخروج بنجاح* ✅\n🔐 *- للأمان ولئلا تنسى كلمة مرورك قمنا بتغييرها وارسلناها لك للاحتياط اذا نسيتها ⬇️.*\n🔑 *- كلمة المرور : * `++PW++` \n📧* - البريد الإلكتروني :- ++MAIL++*",
	'loading'=>[
		'buyCard'=>'⚙️ ⁞ جارِ تجهيز الكرت لك... ✔️.',
	],
	'time'=>[
		'PM'=>'مساءاً',
		'AM'=>'صباحاً',
	],
	'errors'=>[
		'pw_short'=>"⛔ - كلمة المرور قصيرة جداً \n✔️ - يجب ان يتراوح طول كلمة مرورك ما بين *6 و 12 أرقام او احرف إنجليزية*.\n💭 - نقترح استخدام رقم هاتفك ✅.",
		'pw_tall'=>"⛔ - كلمة المرور أطول من اللازم \n✔️ - يجب ان يتراوح طول كلمة مرورك ما بين *6 و 12 أرقام او احرف إنجليزية*.\n💭 - نقترح استخدام رقم هاتفك ✅.",
		'pw_bad'=>"⛔ - كلمة المرور تحتوي على حروف غير مسموح باستخدامها\n*✔️ - يجب ان تكون كلمة المرور حصراً بالأرقام أو الأحرف الإنجليزية فقط*\n💭 - نقترح استخدام رقم هاتفك ✅.",
	],
		
];

$comfirm_buttons  = [
	'Yes_'=>'✅ ⁞ نعم.',
	'back_'=>'⛔ ⁞ لا.',
];

$no_con = [
	'noAdded'=>'لم يتم إضافة دول بهذا القسم في الوقت الحالي ♨️',
];

$add_apps     = [
	'wa'=>'واتساب ',
	'tg'=>'تيليجرام ',
	'tw'=>'تويتر ',
	'fb'=>'فيسبوك ',
	'imo'=>'ايمو ',
	'au'=>'حراج ',
	'ig'=>'انستاجرام ',
	'tt'=>'تيكتوك ',
];
$bought_Buttons = [
	'cards_store'=>'💳 • عودة الى المتجر.',
	'try_cards_'=>'🔄 ⁞ شراء كرت ₽ ++P++ مجددا؟ ',
];

$try_nus = [
	'try_buy'=>'- الشراء مجددا بسعر ++P++ روبل 🔄',
	'to_back'=>'- عودة إلى سيرفرات ++APP++ 🧿',
	'select_app'=>'- شراء لتطبيق آخر ؟ ☑️',
	'back_'=>'- العودة إلى القائمة الرئيسية 🏡',
];
$agents_texts     = [
	'home_agent'=>[
		'menuAgent'=>'🔙 رجوع',
	],
	'buttons'=>[
		'dis_balance'=>'⬇️ : خصم رصيد',
		'Add_balance'=>'⬆️ : إضافة رصيد',
	],
	'responses'=>[
		'dis_balance'=>"📥 *- قم بإرسال إيميل الشخص الذي سيتم الخصم من نقاطه* \n⛔ *- بشرط أن يكون الشخص ذاته قد قام بتعبئة رصيد منك* ✔️",
		'Add_balance'=>"📥* - قم بإرسال إيميل الشخص الذي سيتم الإضافة إلى رصيده * \n⛔ *- إذا كان الشخص غير مشترك بالبوت فلا نتحمل مسؤولية ضياع مبلغ التحويل هدراً ، لذا تأكد من نسخ ولصق الإيميل كما هو* ✔️",
		'set_dis'=>"💸 *- أرسل المبلغ المراد خصمه...📥*",
		'set_add'=>"💸 *- أرسل المبلغ المراد إضافته...📤*",
	],
	'success'=>[
		'dis_balance'=>"📥 *- تم خصم ++PC++ روبل من المستخدم ++UR++ بنجاح* ✅",
		'Add_balance'=>"📤 *- تم إضافة ++PC++ روبل إلى حساب المستخدم ++UR++ بنجاح* ✅", 
		'dis_to_user'=>"*🧑🏻‍💻 - بواسطة الوكيل : ++UR++ \n✔️ - تم خصم ++PC++ روبل من رصيدك 📤*",
		'add_to_user'=>"*🧑🏻‍💻 - بواسطة الوكيل : ++UR++\n✔️ - تم إضافة ++PC++ روبل إلى رصيدك 📥*",
	],
	'errors'=>[
		'dis_balance'=>"⛔ *- هذا المستخدم ليس في قاعدة بياناتك*\n✔️ - لذلك لايمكنك الخصم من حسابه",
		'Add_balance'=>"⛔ *- رصيدك غير كافٍ لشحن حساب الزبون*\n💸 - قم بشحن حسابك من خلال التواصل مع الإدارة : $manger ✅",
	],
	'sessions'=>[
		'dis_balance'=>'set_dis',
		'Add_balance'=>'set_add',
	],
	'menu'=>"🙋🏻‍♂️ -  أهلا عزيزي الوكيل\n⬇️ - هذه هي قائمة التحكم الخاصة بك ✔️.",
];

$foundition_texts = [
	'noAgents'=>"⛔ - لايوجد وكلاء نشطين في الوقت الحالي ✔️.",
	'noShows'=>"🌟 - لم يتم اضافه دول لقسم العروض حتى الان\n☑️ - حاول مرة أخرى في وقت لاحق.",
	'cAll'=>"👥 *- عدد مشتركين بوتك هو ++CM++ مشترك* ✅🔥.",
];

$posts_texts = [
	'sendPost'=>"
💬 *- أرسل رسالتك ليتم نشرها لـ ++CM++ مشترك 👥*

✅ *- بإمكانك إرسال توجيه أيضاً وسيتم الإذاعة بالتوجيه 🗣️.*
	",
	'donePost'=>"✅ *- تم الإذاعة بنجاح ل ++CM++ مشترك بالبوت 🤖*",
	'forPost'=>"✅ *- تم التوجيه بنجاح لأكثر من ++CM++ مشترك بالبوت 🤖*",
];

$notices_texts = [
	#channel 1
	'ban'=>"
⚜ تم حضر رقم من البوت:

☎️ ⁞ الرقم : ++N++
🧩 ⁞ الدولة : ++C++
🎯 ⁞ رمز الدولة : ++CC++
🎬 ⁞ التطبيق : ++APP++
🎟 ⁞ الرصيد : ++B++
🏋 ⁞ الايدي : ++ID++
🔥 ⁞ السعر : ₽ ++P++
🤸‍♂ ⁞ الحساب : ++M++
🎗 ⁞ الموقع : ++S++
	",
	'buy'=>"
⚜ تم شراء رقم لتطبيق ++APP++

☎️ ⁞ الرقم : ++N++
🧩 ⁞ الدولة : ++C++
🎯 ⁞ رمز الدولة : ++CC++
🎟 ⁞ الرصيد : ++B++
🏋 ⁞ الايدي : ++ID++
🔥 ⁞ السعر : ₽ ++P++
🤸‍♂ ⁞ الحساب : ++M++
🎗 ⁞ الموقع : ++S++
	",
	##### channel 2
	'full'=>"
⚜ تم وصول كود الرقم:

☎️ ⁞ الرقم : ++N++
🚸 ⁞ الكود : ++CODE++
🧩 ⁞ الدولة : ++C++
🎯 ⁞ رمز الدولة : ++CC++
🎬 ⁞ التطبيق : ++APP++
🎟 ⁞ الرصيد : ++B++
🏋 ⁞ الايدي : ++ID++
🔥 ⁞ السعر : ₽ ++P++
🤸‍♂ ⁞ الحساب : ++M++
🎗 ⁞ الموقع : ++S++
	",
	#### channel 3
	'signup'=>"
☑️ ⁞ تم إنشاء حساب جديد في البوت.!✔

📧 ⁞ الحساب: ++M++
🔐 ⁞ كلمة السر: ++PW++
🆔 ⁞ أيدي الحساب: ++ID++
⚜ ⁞ إسم العضو: ++NAME++
🏷 ⁞ جهة الاتصال : ++N++
🌀 ⁞ المعرف: ++U++
	",
	'changePW'=>"
🔰 ⁞ قام احدهم بتغيير كلمة السر لحسابة؟!

📧 ⁞ الحساب: ++M++
♻️ ⁞ كلمة السر القديمة: لا يمكن قراءتها بسبب التشفير ✅
🔐 ⁞ كلمة السر الجديدة: ++PW++
🆔 ⁞ أيدي المستخدم: ++ID++
⚜ ⁞ إسم المستخدم: ++NAME++
🌀 ⁞ المعرف: ++U++
	",
	'buyCard'=>"
🎟 ⁞ تم شراء كرت الآن ⚜

🅿️ ⁞ فئة الكرت: ₽ ++CP++
🛅 ⁞ الكرت: ++CN++
💰 ⁞ رصيده المتبقي: ++B++
🛃 ⁞ سعر الكرت: ₽ ++P++
🤸‍♂ ⁞ الحساب: ++M++ 🌐
🆔 ⁞ المشتري: ++ID++
	",
	'chargeCard'=>"
🎟 ⁞ تم شحن كرت في البوت ⚜
🎫 ⁞ لصالح: ++OM++ 🌐

🅿️ ⁞ القيمة: ₽ ++P++
💰 ⁞ رصيده: ₽ ++B++
🛅 ⁞ الكرت: ++C++
🎗 ⁞ الشاحن: ++CHM++ 🌐
🆔 ⁞ ايدية: ++ID++
	",
];
	
$notfounfs   = '❌ لا يوجد';
$bkkkkk = ['back'=>'🔙 رجوع'];

$signup_texts = [
	'Human'=>"📞 - إضغط هنا لمشاركة رقم هاتفك ✅🔥.",
	'captcha_text'=>"🔐 - لأمان *حسابك وحماية خصوصيتك ، نحتاج للتحقق من انك لست روبوت* 🤖\n\n☑️ - إضغط على زر *لست روبوت* الظاهر أمامك على كيبورد المحادثة ⬇️",
	'captcha_error'=>"⛔ *- يرجى إرسال الجهة الخاصة بك*\n☑️ - اضغط *الزر أدناه* 🗣️",
	'message_cp'=>"🧑🏻‍💻 - نحتاج لمعرفة رقم هاتفك قبل البدء بتسجيل الدخول *📞 (تم إتخاذ هذا الإجراء بسبب الحسابات الوهمية ⚠️).*",
	'done_signup'=>"✅ - *تم إنشاء حسابك بنجاح*\n📧 - *الإيميل :- * ++MAIL++\n🔑 - *كلمة المرور* `++PASSWORD++`",
	'Have_Mail'=>"⛔ - لديك حساب مسجل في النظام مسبقا\n✅ - قم بتسجيل الدخول عبر الضغط على الإيميل أدناه ⬇️",
	'login_error'=>"⛔ *- هناك خطأ في البريد الإلكتروني أو كلمة المرور ✔️.*",
	'Have_Account'=>"⛔ - لا يمكنك إنشاء أكثر من حساب 🔥",
	'send_mail'=>"✔️ - قم بإرسال البريد الإلكتروني الذي تود التسجيل به\n🌐 - مثلا : Aldorafy@aymn.net ✅.",
	'send_password'=>"⬇️ *- قم بإرسال كلمة المرور الخاصة بهذا الحساب* 🔑.",
	'error_mail'=>"⛔ - عذراً\n✔️ - البريد الإلكتروني غير صحيح.",
	'setup_befor'=>"🔄 - قم بتسجيل الدخول اولاً.",
	'done_login'=>"✅ - تم تسجيل الدخول بنجاح\n✔️ - سيتم تحويلك الى لوحة التحكم.",
];

$problems     = [
	'WAIT'=>"🧭 - انتظر ++S++ ثانية ثم حاول إلغاء الرقم مجددا ✅",
	'[404 NO_COUNTRY_ADDED]'=>"⚠️ - لم يتم إضافة سيرفرات لهذه الدولة حتى الان.\n☑️ - جرب دولة أخرى او حاول لاحقاً.",
	'NO_BALANCE'=>"💸 - لا يوجد لديك رصيد كافي لشراء الرقم.\n☑️ - قم بشحن حسابك في البوت أولاً.",
	'NO_NUMBERS'=>"⚠️ - لا يوجد أرقام لهذه الدولة حالياً\n☑️ - جرب دولة أخرى او حاول مجدداً 🔄.",
	'NO_DATA'=>"♻️ *- قم بتحديث الصفحة...*",
	'NO_SERVICE'=>"⛔ *- تعذر تنفيذ الأمر لغرض الصيانة* ⚙️.",
	'NO_CODE'=>"
⚠️ - لم يصل الكود
🔄 - انتضر قليلاً ثم أضغط على زر تحديث.
",
	'NO_TIME'=>"⏰ - انتهى الوقت المتاح لطلب كود الرقم.",
	'NO_CANCEL'=>"⛔ - لا يمكنك الغاء الرقم بعد وصول الكود 🙄♥️.",
	'NO_RETURN'=>"❌ - تم إلغاء الرقم بعد انتهاء المدة المحددة ولذلك لم يعد لك البوت قيمة الرقم إلى حسابك تلقائيا\n🧑🏻‍💻 - سيقوم المطور بالتحقق من حالة الرقم وفي حال لم يصل الكود سيتم إعادة قيمة الرقم إلى حسابك ✅.",
	'NO_RESTRICTE'=>"🎁 - تم إعادة قيمة الرقم ++P++ روبل إلى حسابك ✅🔥.",
	'CHECK'=>"
💢 - طلب إعادة المال
💯 - قام العميل ++MAIL++ / ++TGNAME++ بإلغاء رقم بعد مرور 20 دقيقة
☑️ :- الرقم ++N++
💫 :- السعر ++P++ روبل
☄️ :- الموقع :- ++S++
🌐 :- أرجو منك التحقق من حالة الرقم وإن كان الرقم ملغي بواسطة الموقع تلقائيا أعد مبلغ الشراء إلى حساب المستخدم
",
	'RESENDED'=>"
🔥 - *تم وصول الكود مرة أخرى ☑️*
☎️ - *الرقم : * `++N++`
✉️ - *الكود الجديد :* `++C++`
",
];

$back_home     = ['back_'=>'⏭ ⁞ رجوع'];

$extra_buttons = [
	'search_'=>' ⁞ البحث عن دولة 🔍',
	'back_'=>'⏭ ⁞ رجوع',
	'next_'=>'التالي.⬅️',
	'first_'=>'➡️ السابق.'
];

$hanf_buttons = [
	'back_'=>'⏭ ⁞ رجوع',
	'next_'=>'التالي.⬅️'
];

$banf_buttons = [
	'first_'=>'➡️ السابق.',
	'back_'=>'⏭ ⁞ رجوع'
];

$start_buttons = [
	'login'=>'↩️ - تسجيل الدخول.',
	'signup'=>'☑️ - إنشاء حساب جديد.',
	'privacy'=>'⚠️ - شروط الإستخدام.',
	'newUsers'=>'⛔ - هام للاعضاء الجدد.',
	"https://t.me/{$manger}"=>'👤 - مدير البوت.',
	'recently'=>'📊 - الإحصائيات.',
	'botChannel'=>'🖥️ - قناة البوت.',
	'learning'=>'📋 - شرح البوت',
	'help'=>'💬 - طلب المساعدة.'
];

$text_home_v = [
	'support_contact'=>"✉️ *- أرسل رسالتك / إستفسارك وسيتم الرد عليك من قبل الدعم الفني في أسرع وقت ممكن*✅\n⛔ - يجب أن تكون مسجلا دخولا لإستخدام التواصل ✔️",
	'supportCMD'=>"✅ *- تم إرسال رسالتك للدعم الفني وسيتم الرد عليك بأسرع وقت ممكن 🗣️*",
	'supportFWD'=>"⛔ *- لا يمكنك التواصل مع الدعم الفني عبر توجيه الرسائل من محادثات أخرى 🙄.*",
	'privacy'=>"
- مرحباً عزيزي.

- اولاً: هذا البوت مخصص لعمل ارقام وهمية لجميع مواقع التواصل الإجتماعي وزيادة متابعين جميع تطبيقات السوشل ميديا.

*- ثانياً: هذا البوت لايتحمل مسؤولية* الارقام في حالة أنها انسرقت او انحظرت , بمعنى: *البوت غير مسؤول عن الرقم بعد شرائه.
- يرجى عدم استعمال الارقام في أشياء قد تغضب الله عزوجل او تنحرف عن المسار الاسلامي كالإختراقات والإبتزازات والمعاكسات وغيرها.*

*- تعليمات بسيطة حول البوت:*

- اولاً: *البوت يقوم بشراء الأرقام تلقائياً من موردين بالجملة *،  ثم يقوم بتجزئتها وبيعها لعملائنا الأكارم, لذلك ياعزيزي *نحن لا نستطيع فحص جميع الارقام في حالة كانت مستخدمة او جديدة *،  ببساطه ،  *يمكنك إلغاء الارقام المستخدمة من قبل وشراء الارقام الجديده فقط*.
- ثانياً: قد لاتصل الأكواد الى بعض الأرقام, لذلك ياعزيزي يمكنك دائماً إستخدام واتساب الاخضر المعدله تم نشره في قناتنا على التيليجرام ،  *إضغط هنا لرؤيته *.

- [#تعليمات_بسيطة_ومبدأية]

- عند شراء رقم, قم بفحصه أولاً ،  ما إذا كان الرقم جديداً أو لا.
- لفحص الرقم, أضغط على زر *(عرض الرقم في واتساب)* بعد شراء الرقم ،  سيقوم بتوجيهك الى الواتساب ، في حالة قال لك *( هذا الرقم ليس في واتساب )* هذا يعني ان الرقم جديد ،  ولم يستخدم في واتساب من قبل.
*- اما في الحالات الأخرى فهذا يعني أن الرقم مستخدم في واتساب ولا نتحمل مسؤولية تفعيله في اي حال من الاحوال.*

- أما بالنسبة لوصول الكود, بعض الارقام لايصل لها الكود احياناً, لذلك عليك اولاَ استخدام نسخه واتساب الاخضر المعدله خاصه بطلب الأكواد تم نشرها بالفعل على قناتنا $channelbotig
- في حالة انه لم يصل الكود في هذه النسخه, قم بعمل ارسال رسالة مجدداً في الواتساب وانتظر نصف دقيقة واضغط تحديث, في حالة انه لم يصل بعد, قم بإلغائه وشراء رقم آخر.

لمعرفة المزيد انضم بقناة البوت $channelbotig",
	'newUsers'=>"
⁞ هام للأعضاء الجُدد في بوت ⌯$BotNM .

⁞ هذا البوت مخصّص لعمل أرقام وهمية لتفعيل مواقع التواصل الإجتماعي ، وزيادة متابعين جميع تطبيقات السوشل ميديا ،  *ايضاً لانتحمل مسؤولية الأرقام بعد شراءِها.*

⁞ يعمل البوت عبر عدّة سيرفرات او عدّة مورّدين مختصّين بتوفير الأرقام من دُول معيَّنة ، ولبرامج محدّدة ، وكلّ سيرفر او مُورد له سِعر خاص فيه.

⁞ هذا البوت لايظمن أي رقم بعد شراءِه ، حتى اذا لم يشتغل لديك ، مجرد شراء الرقم يعني إخلاء المسؤولية، وهذا موضح في *شروط الاستخدام.*

⁞* مسؤولية استخدامك للأرقام على رب العباد ، لذلك لاتستخدم الأرقام في اشياء مخالفة للدين.*",
	'learning'=>"
🤿 ¦ طريقة إستخدام البوت:

#1 قم بتسجيل حساب جديد في البوت (لن يتم طلب شيء منك ك إيميل او غيره) 🖤.

#2 قم بشحن رصيدك أولا بأحد الطرق التي تستطيع الدفع بها لكي تستطيع شراء ارقام من البوت🤍.

#3 بعد شحن رصيد قم ب شراء ارقام بكل سهولة ويسر. 💙(:

💠 ¦ تواصل مع الدعم اذا واجهتك مشاكل. 📬",
	'recently'=>"
📊 ⁞ إحصائيات البوت:

📋 ⁞ عدد العملاء النشطين: ++U++
☎️ ⁞ عدد الأرقام الجاهزة التي تم شراؤها: ++R++
🛍 ⁞ عدد الكروت التي تم شراؤها: ++C++
📤 ⁞ وصل الروبل المصروف الى: ₽ ++S++
📥 ⁞ عدد الروبل المتبقى: ₽ ++B++
☎️ ⁞ عدد الأرقام المكتملة: ++N++
👥 ⁞ عدد عمليات الرشق: ++F++
💰 ⁞ عدد مرات الشحن: ++M++
",
];
/// Buttons in menu list

$home_buttons = [
	'select_app'=>'☎️ • شراء رقم.',
	'reace_pro'=>'🪄 ⁞ قسم المميز',
	'reace_show'=>'🎗️ ⁞ قسم العروض',
	'reace_rand'=>'🔱 ⁞ سيرفرات عشوائية',
	'my_recent'=>'📊 • الإحصائيات.',
	'add_balance'=>'💸 • شحن روبل.',
	'favourites'=>'🧑🏻‍💻 • وكلاء البوت.',
	'add_follow'=>'👥 • زيادة المتابعين.',
	'invite_users'=>'🤑 • تجميع وربح روبل مجاني.',
	'cards_store'=>'💳 • متجر الكروت.',
	'all_shows'=>'🛍️ • قسم العروض.',
	'ready_numbers'=>'📞 • الأرقام الجاهزة.',
	'setting'=>'⚙️ • إعدادات الحساب.',
	'help'=>'📮 • خدمة العملاء.',
];

$reace_rand     = [
	'select_country#wa12'=>'📞 واتساب 12 روبل',
	'select_country#wa15'=>'🔱 واتساب 15 روبل',
	'select_country#wa20'=>'💠 واتساب 20 روبل',
	'select_country#tg12'=>'☎️ تيليجرام 12 روبل',
	'select_country#tg15'=>'🎫 تيليجرام 15 روبل',
	'select_country#tg20'=>'📲 تيليجرام 20 روبل',
];

$reace_pro      = [
	'select_country#wapro'=>'🪄 واتساب مميز',
	'select_country#tgpro'=>'🎗️ تيليجرام مميز',
];

$reace_show   = [
	'select_country#wash'=>'📞 عروض واتساب',
	'select_country#tgsh'=>'🏦 عروض تيليجرام',
];

$home_user_buttons = [
	'back_'=>'select_app',
	'select_app'=>'select_country',
	'select_country'=>'select_server',
	'select_server'=>'buyNumber',
];

$buttons_buy  = [
	#'get-code_'=>'💬 - طلب الكود',
	#'cancel-order_'=>'♋️ - إلغاء الرقم',
	'view_on'=>'👁️ - عرض الرقم في واتساب. ↖️',
	'refresh'=>'🔄 - تحديث.',
	'cancel'=>'⛔ - إلغاء.',
	'back'=>'🔙 - رجوع.',
];

$text_buy = [
	'Count'=>'✅ - التوفير.',
	'Price'=>'💸 - السعر.',
	'Server'=>'🌐 - السيرفر.',
	#'buy'=>"☎️ *- تم شراء الرقم بنجاح »»» ✅\n\n📲 - التطبيق :- ++APP++ ✨\n🌏 - الدولة :- ++COUNTRY++\n\n📞 - الرقم :-* `++NUMBER++`\n💬 *- كود التسجيل :-* ++CODE++\n\n⚡️* - قم بتسجيل الرقم في ++APP++ ثم قم بالضغط على زر طلب الكود *👇",
	'buy'=>"🔘 *¦ تم شراء الرقم بنجاح.* ☑️\n\n☎️ ¦ الرقم: `++NUMBER++`\n📮 ¦ الكود: *في إنتظار الكود ...*\n🔬 ¦ الحالة: *في الإنتظار.*\n💸 ¦ السعر: ₽ ++P++\n🅿️ ¦ معرف العملية: *++IDT++*\n\n☑️ *¦ إضغط على الرقم لنسخه!*\n⚜ *¦ أدخل الرقم في ال++AN++ لوصول الكود، ثم أضغط على زر تحديث.*",
	'coded'=>"✅ *- تم شراء الرقم بنجاح.*\n\n☎️ ⁞ الرقم : `++NUMBER++`\n💬 ⁞ الكود : `++CODE++`\n💸 ⁞ السعر : *++P++*\n🧿 ⁞ الحالة : مكتمل ☑️.\n📲 ⁞ التطبيق : *++APP++*\n*📥 - تم وصول الكود بنجاح 🤧🖤.*",
	#'cancel'=>"🎗* - تم إلغاء الرقم بنجاح »»» 👇\n\n📲 - التطبيق :- ++APP++ ✨\n🌏 - الدولة :- ++COUNTRY++\n\n📞 - الرقم :-* ++NUMBER++\n💬 *- كود التسجيل :-* ++CODE++\n\n⚡️*- الحالة :- ملغي 🅾*",
	'cancel'=>"📞 *⁞ الرقم:* ++NUMBER++\n\n☑️ ⁞ تم إلغاء الرقم بنجاح.\n📅 ⁞ بتاريخ: * ++DATE++*\n\n⏰ *- التوقيت: ++TIME++*",
];

$success_buttns = [
	'tryGetCode'=>"🔄 - طلب الكود مرة أخرى.",
	'finishID'=>"✅ - إنهاء الحالة.",
];

/// applications and services
/// All each 
$apps_buttons = [
	'select_country#wa'=>'◄ واتساب - Whatsapp 💬.','select_country#tg'=>'◄ تيليجرام - Telegram 📢.',
	'select_country#fb'=>'◄ فيسبوك - Facebook 🌐.','select_country#ig'=>'◄ إنستقرام - Instagram 🌟.',
	'all_shows'=>'✅ • قسم العروض.',
	'select_country#tt'=>'◄ تيكتوك - TikTok 🎥.','select_country#tw'=>'◄ تويتر - Twitter 🐦.',
	'select_country#au'=>'◄ حراج - Haraj 🛍. ','select_country#imo'=>'◄ إيمو - imo 🎙.',
	];
	#'select_country#go'=>'¦ جوجل. 🌏',#'select_country#ig'=>'¦ انستقرام. 🎬

$charge_buttons = [
	'https://t.me/VSSSQ'=>'✅ ⁞ إيداع كريمي (شمال - جنوب).',
	'https://t.me/VSSSq'=>'✅ ⁞ تحويل صرافات (شمال - جنوب).',
	'https://t.me/VSSsq'=>'✅ ⁞ إيداع صرافات (أهلي - راجحي).',
	'https://t.me/VSssq'=>'✅ ⁞ كروت شحن (سوا - سبافون - مبايلي).',
	'https://t.me/Vsssq'=>'✅ ⁞ العملات الرقمية (جميعها).',
	'https://t.me/vsssq'=>'✅ ⁞ البنوك الإلكترونية (بايير - بايبال).',
	'input_card'=>'🛄 ⁞ إدخال كرت شحن.',
	'favourites'=>'🧑🏻‍💻 - شحن عبر الوكلاء.',
];

$resp_other   = [
	'input_card'=>'💳- قم بإرسال رمز الكرت.',
	'done_card'=>"✅ - تم اضافة الى حسابك ++PRICE++ روبل 💰.\n💸 - أصبح رصيدك الآن : ++BALANCE++ روبل ✔️🔥.",
	'used_card'=>"⛔ - رمز الكرت غير صحيح ✔️.",
];

$recent_buttons = [
	'cards_recent'=>'💳 ⁞ سجل الكروت.',
	'numbers_recent'=>'☎️ ⁞ سجل الأرقام.',
	'bot_recent'=>'🤖 ⁞ سجل البوت.',
	'ready_recent'=>'📞 ⁞ سجل الجاهز.'
];

$store_buttons = [
	'card_price'=>'السعر. ⬇️',
	'card_class'=>'فئة الكرت. ⬇️',
	'cardu_10_10.45P'=>'10.45 ₽',
	'card_10_10.45P'=>'10 روبل. 💰',
	'cardu_15_15.75P'=>'15.75 ₽',
	'card_15_15.75P'=>'15 روبل. 💰',
	'cardu_20_20.85P'=>'20.85 ₽',
	'card_20_20.85P'=>'20 روبل. 💰',
	'cardu_50_52.50P'=>'52.50 ₽',
	'card_50_52.50P'=>'50 روبل. 💰',
	'cardu_100_105P'=>'105 ₽',
	'card_100_105P'=>'100 روبل. 💰',
	'cardu_200_210.5P'=>'210.5 ₽',
	'card_200_210.5P'=>'200 روبل. 💰',
	'cardu_300_313.5P'=>'313.5 ₽',
	'card_300_313.5P'=>'300 روبل. 💰',
	'cardu_400_429.5P'=>'429.5 ₽',
	'card_400_429.5P'=>'400 روبل. 💰',
	'cardu_500_530.5P'=>'530.5 ₽',
	'card_500_530.5P'=>'500 روبل. 💰'
];
	
	
 

$settings_buttons = [
	'change_password'=>'🔑 - تغيير كلمة السر.',
	'balance_forward'=>'🔄 - تحويل رصيد.',
	'logout'=>'🚷 - تسجيل خروج.'
];

$help_buttons = [
	'loop_questions'=>'⁞ الأسئلة الشائعة. 📋',
	'support_contact'=>'⁞ تواصل مع الدعم أونلاين. 💬'
];

$H2_buttons   = [
	'select_app'=>array_merge($apps_buttons,$back_home),
	'reace_show'=>array_merge($reace_show,$back_home),
	'reace_rand'=>array_merge($reace_rand,$back_home),
	'reace_pro'=>array_merge($reace_pro,$back_home),
	'add_balance'=>array_merge($charge_buttons,$back_home),
	'my_recent'=>array_merge($recent_buttons,$back_home),
	'add_follow'=>$back_home,
	'invite_users'=>$back_home,
	'cards_store'=>array_merge($store_buttons,$back_home),
	'setting'=>array_merge($settings_buttons,$back_home),
	'help'=>array_merge($help_buttons,$back_home)
];

$sercet   = '✔️ - سيرفر ';
#print_r($H2_buttons);

##echo $H2_buttons['select_app']['app_tiktok'];
/// Countries names
/// code => name

$apps_code_name = [
	'wa'=>'◄ واتساب - Whatsapp 💬.',
	'tg'=>'◄ تيليجرام - Telegram 📢.',
	'fb'=>'◄ فيسبوك - Facebook 🌐.',
	'ig'=>'◄ إنستقرام - Instagram 🌟.',
	'tt'=>'◄ تيكتوك - TikTok 🎥.',
	'tw'=>'◄ تويتر - Twitter 🐦.',
	'au'=>'◄ حراج - Haraj 🛍. ',
	'imo'=>'◄ إيمو - imo 🎙.',
	'wa12'=>'📞 واتساب 12 روبل',
	'wa15'=>'🔱 واتساب 15 روبل',
	'wa20'=>'💠 واتساب 20 روبل',
	'tg12'=>'☎️ تيليجرام 12 روبل',
	'tg15'=>'🎫 تيليجرام 15 روبل',
	'tg20'=>'📲 تيليجرام 20 روبل',
	'wapro'=>'🪄 واتساب مميز',
	'tgpro'=>'🎗️ تيليجرام مميز',
	'tgsh'=>'🏦 عروض تيليجرام',
	'wash'=>'📞 عروض واتساب',
];
$countries_names = [
	'RU'=>'🇷🇺 روسيا', 'UA'=>'🇺🇦 أوكرانيا', 
	'KZ'=>'🇰🇿 كازاخستان', 'CN'=>'🇨🇳 الصين',
	'PH'=>'🇵🇭 الفيلبين', 'MM'=>'🇲🇲 ميانمار',
	'ID'=>'🇮🇩 إندونيسيا', 'MY'=>'🇲🇾 ماليزيا',
	'KE'=>'🇰🇪 كينيا', 'TZ'=>'🇹🇿 تنزانيا',
	'VN'=>'🇻🇳 فيتنام', 'KG'=>'🇰🇬 قيرغيزستان',
	'US'=>'🇺🇸 أمريكا', 'IL'=>'🥾🇮🇱 إسرائيل',
	'HK'=>'🇭🇰 هونغ كونغ', 'PL'=>'🇵🇱 بولندا',
	'GB'=>'🇬🇧 بريطانيا', 'MG'=>'🇲🇬 مدغشقر',
	'ZR'=>'🇨🇬 الكونغو', 'NG'=>'🇳🇬 نيجيريا',
	'MO'=>'🇲🇴 ماكاو', 'EG'=>'🇪🇬 مصر',
	'IN'=>'🇮🇳 الهند', 'IE'=>'🇮🇪 أيرلندا',
	'KH'=>'🇰🇭 كمبوديا', 'LA'=>'🇱🇦 لاوس',
	'HT'=>'🇭🇹 هايتي', 'CI'=>'🇨🇮 ساحل العاج',
	'GM'=>'🇬🇲 غامبيا', 'RS'=>'🇷🇸 صربيا',
	'YE'=>'🇾🇪 اليمن', 'ZA'=>'🇿🇦 جنوب أفريقيا',
	'RO'=>'🇷🇴 رومانيا', 'CO'=>'🇨🇴 كولومبيا',
	'EE'=>'🇪🇪 إستونيا', 'AZ'=>'🇦🇿 أذربيجان',
	'CA'=>'🇨🇦 كندا', 'MA'=>'🇲🇦 المغرب',
	'GH'=>'🇬🇭 غانا', 'AR'=>'🇦🇷 الأرجنتين',
	'UZ'=>'🇺🇿 أوزبكستان', 'CM'=>'🇨🇲 الكاميرون',
	'TD'=>'🇹🇩 تشاد', 'DE'=>'🇩🇪 ألمانيا',
	'HR'=>'🇱🇹 ليتوانيا', 'LT'=>'🇭🇷 كرواتيا',
	'SE'=>'🇸🇩 السودان', 'IQ'=>'🇮🇶 العراق',
	'NL'=>'🇳🇱 هولندا', 'LV'=>'🇱🇻 لاتفيا',
	'AT'=>'🇦🇹 النمسا', 'BY'=>'🇧🇾 بيلاروسيا',
	'TH'=>'🇹🇭 تايلاند', 'SA'=>'🇸🇦 السعودية',
	'MX'=>'🇲🇽 المكسيك', 'TW'=>'🇹🇼 تايوان',
	'ES'=>'🇪🇸 إسبانيا', 'IR'=>'🇮🇷 إيران',
	'DZ'=>'🇩🇿 الجزائر', 'SI'=>'🇸🇮 سلوفينيا',
	'BD'=>'🇧🇩 بنغلاديش','SN'=>'🇸🇳 السنغال',
	'TR'=>'🇹🇷 تركيا','CZ'=>'🇨🇿 التشيك',
	'LK'=>'🇱🇰 سيريلانكا','PE'=>'🇵🇪 بيرو',
	'PK'=>'🇵🇰 باكستان','NZ'=>'🇳🇿 نيوزيلاندا',
	'GN'=>'🇬🇳 غينيا','ML'=>'🇲🇱 مالي',
	'VE'=>'🇻🇪 فنزويلا','ET'=>'🇪🇹 أثيوبيا',
	'MN'=>'🇲🇳 منغوليا','BR'=>'🇧🇷 البرازيل',
	'AF'=>'🇦🇫 أفغانستان','UG'=>'🇺🇬 أوغندا',
	'AO'=>'🇦🇴 أنغولا','CY'=>'🇨🇾 قبرص',
	'FR'=>'🇫🇷 فرنسا','PG'=>'🇵🇬 بابوا غينيا',
	'MZ'=>'🇲🇿 موزمبيق','NP'=>'🇳🇵 نيبال',
	'BE'=>'🇧🇪 بلجيكا','BG'=>'🇧🇬 بلغاريا',
	'HU'=>'🇭🇺 هنغاريا','MD'=>'🇲🇩 مولدوفا',
	'IT'=>'🇮🇹 إيطاليا','PY'=>'🇵🇾 باراغواي',
	'HN'=>'🇭🇳 هندوراس','TN'=>'🇹🇿 تنزانيا',
	'NI'=>'🇳🇮 نيكاراغوا','TL'=>'🇹🇱 تيمور',
	'BO'=>'🇧🇴 بوليفيا','CR'=>'🇨🇷 كوستاريكا',
	'GT'=>'🇬🇹 غواتيمالا','AE'=>'🇦🇪 الإمارات',
	'ZW'=>'🇿🇼 زيمبابوي','PR'=>'🇵🇷 بورتوريكو',
	'SD'=>'🇸🇩 السودان','TG'=>'🇹🇬 توجو',
	'KW'=>'🇰🇼 الكويت','SV'=>'🇸🇻 السلفادور',
	'LY'=>'🇱🇾 ليبيا','JM'=>'🇯🇲 جامايكا',
	'TT'=>'🇹🇹 ترينداد وتوباغو','EC'=>'🇪🇨 الاكوادور',
	'SZ'=>'🇵🇲 سوازيلاند','OM'=>'🇴🇲 عمان',
	'BA'=>'🇧🇦 البوسنة','DO'=>'🇩🇴 الدومينيكان',
	'SY'=>'🇸🇾 سوريا','QA'=>'🇶🇦 قطر',
	'PA'=>'🇵🇦 بنما','CU'=>'🇨🇺 كوبا',
	'MR'=>'🇲🇷 موريتانيا','SL'=>'🇸🇱 سيراليون',
	'JO'=>'🇯🇴 الأردن','PT'=>'🇵🇹 البرتغال',
	'BB'=>'🇧🇲 بربادوس','BI'=>'🇧🇮 بوروندي',
	'BJ'=>'🇧🇯 بنين','BN'=>'🇧🇳 بروناي',
	'BS'=>'🇧🇸 باهاما','BW'=>'🇧🇼 بوتسوانا',
	'BZ'=>'🇧🇿 بليز','CF'=>'🇨🇫 إفريقيا الوسطى',
	'DM'=>'🇩🇲 الدومينيكا','GD'=>'🇬🇩 غرينادا',
	'GE'=>'🇬🇪 جورجيا','GR'=>'🇬🇷 اليونان',
	'GW'=>'🇬🇼 غينيا بيساو','GY'=>'🇬🇫 غويانا',
	'IS'=>'🇮🇸 آيسلندا','KM'=>'🇰🇲 جزر القمر',
	'LR'=>'🇱🇷 ليبيريا','LS'=>'🇱🇸 ليسوتو','MW'=>'🇲🇼 ملاوي',
	'NA'=>'🇳🇦 ناميبيا','NE'=>'🇳🇪 النيجر',
	'RW'=>'🇷🇼 رواندا','SK'=>'🇸🇰 سلوفاكيا',
	'SR'=>'🇸🇷 سورينام','TJ'=>'🇹🇯 طاجيكستان',
	'MC'=>'🇲🇨 موناكو','BH'=>'🇧🇭 البحرين',
	'ZM'=>'🇿🇲 زامبيا','AM'=>'🇦🇲 أرمينيا',
	'SO'=>'🇸🇴 الصومال','CG'=>'🇨🇬 الكونغو',
	'CL'=>'🇨🇱 تشيلي','BF'=>'🇧🇫 بوركينا فاسو',
	'LB'=>'🇱🇧 لبنان','GA'=>'🇬🇦 الغابون',
	'AL'=>'🇦🇱 ألبانيا','UY'=>'🇺🇾 أوروغواي',
	'MU'=>'🇲🇺 موريشيوس','BT'=>'🇧🇹 بوتان',
	'MV'=>'🇲🇻 جزر المالديف','GP'=>'🇸🇧 جوادلوب',
	'TM'=>'🇹🇲 تركمانستان','GF'=>'🇬🇫 غينيا الفرنسية',
	'FI'=>'🇫🇮 فنلندا','LC'=>'🇱🇨 سانات لوسيا',
	'LU'=>'🇱🇺 لوكسمبورغ','VC'=>'🇻🇨 سانت فينسنت',
	'GQ'=>'غينيا الاستوائية 🇬🇶','DJ'=>'🇩🇯 جيبوتي',
	'AG'=>'🇦🇬 أنتيغوا وبربودا','SB'=>'🇸🇧 جزر سليمان',
	'ME'=>'🇲🇪 الجبل الأسود','DK'=>'🇩🇰 الدنمارك',
	'CH'=>'🇸🇪 السويد','NO'=>'🇳🇴 نورواي',
	'AU'=>'🇦🇺 أستراليا','ER'=>'🇪🇷 إريتريا',
	'SS'=>'🇸🇸 جنوب السودان',

];

//// Admin text commands

$names_sites  = [
	'fastpva.com'=>'🌐 fastpva.com',
	'5sim.biz'=>'🌐 5sim.biz',
	'sms-man.com'=>'🌐 sms-man.com',
	'vak-sms.com'=>'🌐 vak-sms.com',
	'vps.sms3t.com'=>'vps.sms3t.com',
	'dropsms.ru'=>'dropsms.ru',
	'mm.duraincloud.com'=>'mm.duraincloud.com',
	'h5.haozhuma.com'=>'h5.haozhuma.com',
	'sms-code.ru'=>'sms-code.ru',
	'thesupercomm.com'=>'thesupercomm.com'
];

$sites_buttons = [
	's_a_s_fastpva.com'=>'🌐 fastpva.com',
	's_a_s_5sim.biz'=>'🌐 5sim.biz',
	's_a_s_sms-man.com'=>'🌐 sms-man.com',
	's_a_s_vak-sms.com'=>'🌐 vak-sms.com',
	's_a_s_vps.sms3t.com'=>'vps.sms3t.com',
	's_a_s_dropsms.ru'=>'dropsms.ru',
	's_a_s_mm.duraincloud.com'=>'mm.duraincloud.com',
	's_a_s_h5.haozhuma.com'=>'h5.haozhuma.com',
	's_a_s_sms-code.ru'=>'sms-code.ru',
	's_a_s_thesupercomm.com'=>'thesupercomm.com'
];

$modes_buttons = [
	'all'=>'🎗 جميع السيرفرات والمشغلين',
	'shows'=>'🎁 العروض والتخفيضات'
];
$Numbts = '💯 - لا يتوفر أرقام بهذا السيرفر العشوائي حالياً ';
/*
صنع كروت 💳
إضافة دولة ↗️
حذف دولة 🚫
إضافة رصيد ♻️
خصم رصيد 📛
إحصائيات البوت 🌚
فتح وقفل الأقسام 🔏
تقييد عضو ⛔️
فك تقييد عضو ??
فك تقييد عضو عبر الايدي ☑️
إذاعة نشر 📩
عدد المشتركين 👥
رفع وحذف API المواقع ⤵️

*/


$ow_panel  = [
	'control_buttons'=>[
		'addBalance'=>'💯 إضافة رصيد',
		'delBalance'=>'🔻 خصم رصيد',
		'addCard'=>'💫 إضافة كرت شحن',
		'delCard'=>'❌ إلغاء كرت شخن',
	],
	'home_buttons'=>[
		'control'=>'💯 تحكم من هنا 👇',
		'delCountry'=>'حذف دولة 🚫',
		'addCountry'=>'إضافة دولة ↗️',
		'addRand'=>'إضافة دولة عشوائية 💢',
		'delRand'=>'حذف دولة عشوائية 🪣',
		'delBalance'=>'خصم رصيد 📛',
		'addBalance'=>'إضافة رصيد ♻️',
		'setKeys'=>'رفع وحذف API المواقع ⤵️',
		'delCard'=>'🗑️ إلغاء كرت',
		'addCard'=>'صنع كروت 💳',
		'delJoin'=>'🌀 إلغاء الإشتراك الإجباري',
		'setJoin'=>'🌐 تعيين الإشتراك الإجباري',
		'status'=>'إحصائيات البوت 🌚',
		'delInvite'=>'☄️ إلغاء قسم الإحالة',
		'setInvite'=>'🤝 تعيين نقود الإحالة',
		'delABan'=>'حذف حساب ⛔️',
		'unbanU'=>'إلغاء حظر مستخدم ☄️',
		'viewUM'=>'كشف مستخدم او حساب 👀=',
		'addInvestor'=>'👮‍♂ : إضافة وكيل',
		'delInvestor'=>'🙎‍♂ : حذف وكيل',
		'postAll'=>'إذاعة نشر 📩',
		'cMembers'=>'عدد المشتركين 👥',
		
		
		
	],
	'texts'=>[
		'addBalance'=>'قم بإرسال ايميل العضو لإضافة رصيد ✔️',
		'delBalance'=>'قم بإرسال ايميل العضو لخصم رصيد ⛔',
		'addCard'=>'ادخل قيمة الروبل الذي تريد وضعه في الكرت ✔️',
		'delCard'=>'ارسل رقم الكرت لالغائه ⛔',
		'delABan'=>'🌐 - قم بإرسال أيدي أو إيميل لحظره',
		'unbanU'=>'🌐 - قم بإرسال أيدي لإلغاء حظره',
		'viewUM'=>'🌐 - قم بإرسال أيدي أو إيميل لكشفه',
		'addInvestor'=>'قم بإرسال ايميل الشخص المراد رفعه وكيلا في البوت ✔️',
		'delInvestor'=>'قم بإرسال ايميل الشخص المراد حذفه من وكاله البوت ⛔',
		'setJoin'=>"قم بإرسال معرف القناة كالآتي @KyproCH ✔️.",
		'setInvite'=>"🤞 قم بإرسال عدد النقود التي سيحصل عليها المستخدم مقابل دعوة عضو جديد إلى البوت\n💫 : نقود الإحالة حالياً : ++INV++",
		'delInvite'=>'تم الغاء قسم الإحالة ⛔',
		'setKeys'=>"🌐* :- يمكنك تعديل API KEY المواقع أدناه عبر الضغط على اسم الموقع* 👇",
		'setApiFor'=>"🎗 *: قم بإرسال مفتاح الواجهة البرمجية APIKEY للموقع *",
		'delJoin'=>'تم الغاء الاشتراك الاجباري ⛔',
		'start'=>"🎗 *أهلا عزيزي المالك 🌷*\n🤖 *أنت المتحكم هنا .... فقط اضغط على الأمر ليتم تنفيذه 👇👇*",
		'startAM'=>"- أهلا وسهلا مطوري ++DN++ ، 🖤\n- هذه هي قائمة التحكم الخاصة بك في البوت 💁‍♂️",
		'addCountry'=>'قم بإختيار الموقع الذي تريد إضافة الدولة منه إلى البوت 🎗',
		's_a_s'=>"📲 قم بإختيار التطبيق المراد إضافة الرقم إليه\nمن الكيبورد أدناه 👇",
		's_a_a'=>"✅ الآن قم بإختيار القسم المراد وضع الدولة فيه لتطبيق ++APPNAME++ 💫",
		's_a_m'=>"💯 الآن قم بإختيار الدولة المراد إضافتها لتطبيق ++APPNAME++ 💫\nمن الكيبورد أدناه 👇",
		's2_a_m'=>"💯 الآن قم بإختيار الدولة المراد إضافتها لتطبيق ++APPNAME++ 💫\nمن الكيبورد أدناه 👇",
		's_a_c'=>"🎗️ - تم حفظ الدولة والتطبيق ✅\n☑️ - الدولة : ++COUNTRY++ 🌀\n✳️ - التطبيق :- ++APPNAME++ 📲\n🌐 - الموقع : ++SITE++\n🅿️ - قم بإختيار السيرفر لهذه الدولة ⬇️",
		's_a_r'=>"🎗️ - تم حفظ الدولة والتطبيق ✅\n☑️ - الدولة : ++COUNTRY++ 🌀\n✳️ - التطبيق :- ++APPNAME++ 📲\n🌐 - الموقع : ++SITE++\n⤵️ - سعر الرقم بالموقع هو ++PRICE++\n♻️ - قم بإرسال سعر الرقم لهذه البيانات ⬇️",
		'done_saved_add'=>"🎗️ - تم حفظ الدولة والتطبيق والسعر ✅\n☑️ - الدولة : ++COUNTRY++ 🌀\n✳️ - التطبيق :- ++APPNAME++ 📲\n💰 - السعر : ++PRICE++\n🌐 - الموقع : ++SITE++",
		'delCountry'=>"🎗 *- قم بإختيار التطبيق الذي تود حذف الرقم منه*\n💁‍♂ *- من الكيبورد أدناه 👇",
		'd_a_a'=>"🌐 *- قم بإختيار الدولة التي تريد حذفها من تطبيق ++APPNAME++ ✅\n💁‍♂ *- من الكيبورد أدناه 👇",
		'd_a_m'=>"😎 - قم بإختيار القسم التي تود الحذف منه ",
		'd_a_c'=>"💫 *- سيتم حذف دولة ++COUNTRY++ من التوفير لتطبيق ++APPNAME++ عبر أحد الموفرين\n🎚 *- قم بإختيار الموفر الذي سيتم حذف التوفير منه\n👨‍🔧 * - من الكيبورد أدناه 👇*",
		'd_a_s'=>"✅ *- تم الحذف بنجاح 👇*\n🌏 *- الدولة :- ++COUNTRY++*\n🎗 *- التطبيق :- ++APPNAME++* 📲\n🌐 *- الموقع :- ++SITE++* 🕸\n🤖 *- المورد :- ++CLI++ *⚱\n💰 *- السعر السابق :- ++PRICE++ * 🤑",
	],
	'errors'=>[
		'addInvestor'=>'لايمكن رفع نفس الشخص مرتين ك وكيل في البوت ⛔.',
		'delInvestor'=>'هذا ليس وكيلاً من قبل لحذفه ⛔.',
		'delInvite'=>'قسم الإحالة ملغي مسبقاً ⛔.',
		'setJoin'=>'❌ - خطأ\n ⛔ - لايوجد قناة بهذا اليوزر',
		'delJoin'=>'لايوجد اشتراك إجباري لالغائه ⛔.',
		'mail_not'=>'⛔ - هذا الايميل غير مسجل في البوت ',
		'no_mail'=>' الايميل ليس صحيحاً ⛔.',
		'nu_not'=>'↩️ - يرجى ارسال ارقماً فقط.',
		'no_card'=>'الكرت غير مسجل او انه لم يعد نشطاً ⛔',
		'card_not'=>'↩️ - ارسل ارقاماً او احرفاً انجليزية فقط.',
	],
	'responses'=>[
		'doneAddKey'=>"✅ *تم تعديل المفتاح بنجاح إلى :-* ",
		'addInvestor'=>'✔️ - تم رفعه وكيل بنجاح',
		'delInvestor'=>'✔️ -  تم تنزيل الوكيل بنجاح ',
		'setJoin'=>'الاشتراك الاجباري معين حالياً للقناه ⬅️ ++JOIN++ ',
		'doneAdded'=>'✔️ - تم تعيين الاشتراك الاجباري للقناة ++JOIN++\nتأكد من رفع البوت مشرف في القناة 🤖',
		'doneUp'=>"⬆️ تم رفع مكافئة الإحالة إلى ++INV++ روبل ✅",
		'doneDown'=>"⬇️ تم خفض مكافئة الإحالة إلى ++INV++ روبل ☄️",
		'doneCase'=>"لم يتغير شيء ياهطف 😒💔.",
		'doneaddBalance'=>'تم أرسال النقاط ✔️.',
		'donedelBalance'=>'تم خصم النقاط ✔️.',
		'addBalance'=>'ارسل عدد النقاط المراد شحنها ✔️.',
		'delBalance'=>'ارسل عدد النقاط المراد خصمها ✔️.',
		'send_c_value'=>'ارسل عدد نقاط الكرت ✔️.',
		'send_c_nu'=>'ارسل رقم الكرت ✔️.',
		'doneaddCard'=>"📥 - تم صنع الكرت بنجاح بقيمة ++PRICE++ روبل\n↩️ - الكرت : `++CARD++` ",
		'donedelCard'=>"✔️ - تم الغاء الكرت التالي : *++CARD++*\n↩️ - بقيمة : ++PRICE++ روبل.",
	],
	'adding_buttons'=>[
		'addCountry'=>array_merge($sites_buttons,$back_home),
		's_a_s'=>array_merge($apps_code_name,$back_home),
		's_a_a'=>array_merge($modes_buttons,$back_home),
		's_a_m'=>array_merge(array_slice($countries_names,0,90),$hanf_buttons),
		's2_a_m'=>array_merge(array_slice($countries_names,90),$banf_buttons),
		's_a_c'=>'',
		's_a_r'=>$back_home,
	],
	'delete_buttons'=>[
		'delCountry'=>array_merge($apps_code_name,$back_home),
	],
];

$text_error     = [
	'add'=>'❌ هناك خلل في قواعد البيانات ، تعذر إضافة الرقم في الوقت الحالي',
	'already'=>'لايمكنك اضافه نفس الدولة بنفس السيرفر مرتين ⛔.',
	'controls'=>[
	'
✅ - تم العثور على الحساب

إضغط 👀 لكشف معلومات الحساب 
إضغط ❌ بجانب الحساب لحظر الحساب والمستخدم معا
إضغط ❌ بجانب الأيدي لحظر المستخدم فقط
إضغط ✅ لإلغاء الحظر عن المستخدم 👇
	',
	'
💢 - البيانات غير موجودة ❌
	',
	'
🧐 - لم يتم العثور على المستخدم أو ان المستخدم ليس مسجل دخول
	',
	'
😒 - قم بإرسال أيدي او إيميل فقط 🤓
	',
	'
🌏 - المستخدم بالتأكيد محظور 😎
	',
	'
🙂 - المستخدم بالتأكيد ليس محظور 👍
	',
	'
✅ تم حظر الحساب والمستخدم معا
	',
	'
✅ تم حظر المستخدم فقط ولم يتم حظر الحساب
	',
	'
✅ تم إلغاء الحظر عن المستخدم 💯
	',],
];
/*
if(array_key_exists('RrU',$countries_names)){
	PRINT('OK');
}
*/


?>